app/controllers/api/v1/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
   def non_dark_jokes
     @jokes = Joke.all
     @jokes.each do |joke|

SELECT "jokes".* FROM "jokes"
---
   def single_jokes_alt
     @jokes = Joke.all
     @jokes.each do |joke|